app/controllers/flats_controller.rb

SELECT "flats".* FROM "flats" WHERE (flats.latitude IS NOT NULL AND flats.longitude IS NOT NULL)
---
    def index
      @flats = Flat.all

      # the `geocoded` scope filters only flats with coordinates (latitude & longitude)
      @markers = @flats.geocoded.map do |flat|