app/controllers/offers_controller.rb

    def index
        @offers = Offer.all
---
SELECT "offers".* FROM "offers"

    def create

    @offer = Offer.new(offer_params)

      if @offer.save
---
INSERT INTO "offers" ("title", "description", "points", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Airpods"], ["description", "hahahha"], ["points", 100], ["created_at", "2020-12-17 09:48:45.357248"], ["updated_at", "2020-12-17 09:48:45.357248"]]

def set_offer
@offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]