app/controllers/qr_codes_controller.rb

    def show
      @qr_code = QrCode.find(params[:id])
---
SELECT "qr_codes".* FROM "qr_codes" WHERE "qr_codes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]